Repository: dirnbauer/typo3-records-list-types
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# viewMode.list
source: List View
de: Listenansicht

# viewMode.grid
source: Grid View
de: Kachelansicht

# viewMode.compact
source: Compact View
de: Kompaktansicht

# viewMode.teaser
source: Teaser List
de: Teaser-Liste

# viewMode.switch.title
source: Switch View Mode
de: Ansichtsmodus wechseln

# button.viewMode
source: List Type
de: Listentyp

# noRecords
source: No records found on this page.
de: Keine Datensätze auf dieser Seite gefunden.

# action.edit
source: Edit record
de: Datensatz bearbeiten

# action.hide
source: Hide record
de: Datensatz ausblenden

# action.show
source: Show record
de: Datensatz anzeigen

# action.delete
source: Delete record
de: Datensatz löschen

# action.newRecord
source: Create new record
de: Neuen Datensatz erstellen

source: Sorting
de: Sortierung

source: Sort ascending
de: Aufsteigend sortieren

source: Sort descending
de: Absteigend sortieren

# sort.default
source: Default
de: Standard

# sortingMode.label
source: Order
de: Reihenfolge

# sortingMode.field
source: By Column
de: Nach Spalte

# sortingMode.manual.title
source: Drag and drop to reorder records
de: Per Drag-and-Drop umsortieren

# sortingMode.field.title
source: Sort by a specific column
de: Nach einer Spalte sortieren

# drag.title
source: Drag to reorder
de: Ziehen zum Sortieren

# drag.ariaLabel
source: Press Space to grab and reorder
de: Leertaste drücken zum Greifen und Sortieren

# drag.instructions
source: Press Space or Enter to grab item. Use arrow keys to move. Press Space or Enter to drop, Escape to cancel.
de: Leertaste oder Eingabe drücken zum Greifen. Pfeiltasten zum Bewegen. Leertaste oder Eingabe zum Ablegen, Escape zum Abbrechen.

# drag.grabbed
source: Grabbed. Use arrow keys to move.
de: Gegriffen. Pfeiltasten zum Bewegen.

# drag.position
source: Position %d of %d
de: Position %d von %d

# drag.dropped
source: Dropped at position %d
de: Abgelegt an Position %d

# drag.cancelled
source: Reorder cancelled
de: Sortierung abgebrochen

# drag.moved
source: Item moved to position %d
de: Element an Position %d verschoben

# drag.dropHere
source: Drop here
de: Hier ablegen

# drag.endPosition
source: End position (after last item)
de: Endposition (nach letztem Element)

# pagination.of
source: of
de: von
